In [2]:
# required dependancies
import sqlalchemy as sa
import pandas as pd

In [3]:
engine=sa.create_engine('mysql+pymysql://root:system1234@localhost:3306/db_new')
engine

Engine(mysql+pymysql://root:***@localhost:3306/db_new)

### read a query into a dataframe

#### read_sql_query()

In [7]:
# query and convert to DataFrame
df=pd.read_sql_query('select * from employees',engine)

     ID      Name             Position
0  1001    Akshay       Data Scientist
1  1002     Akash         AWS Engineer
2  1003  Avadhoot      Design Engineer
3  1004     Anuja    Dot Net Developer
4  1005      Anuj  Fullstack Developer

In [10]:
# display
df

     ID      Name             Position
0  1001    Akshay       Data Scientist
1  1002     Akash         AWS Engineer
2  1003  Avadhoot      Design Engineer
3  1004     Anuja    Dot Net Developer
4  1005      Anuj  Fullstack Developer